In [3]:
import pandas as pd
rev=pd.read_csv("revenue.csv",index_col="Date")
rev.head()

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933
1/4/16       730          904    885
1/5/16       114           71    253

In [4]:
s=pd.Series([1,2,3])
s.sum()

6

In [6]:
rev.sum()

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [7]:
rev.sum(axis=0)

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [9]:
rev.sum(axis="index")

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [10]:
rev.sum(axis=1)

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [12]:
rev.sum(axis="columns")

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [13]:
nba=pd.read_csv("nba.csv")
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [16]:
nba.Team

0      Boston Celtics
1      Boston Celtics
2      Boston Celtics
3      Boston Celtics
4      Boston Celtics
            ...
453         Utah Jazz
454         Utah Jazz
455         Utah Jazz
456         Utah Jazz
457               NaN
Name: Team, Length: 458, dtype: object

In [17]:
nba.Name.head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [18]:
type(nba.Name)

pandas.core.series.Series

In [22]:
a=nba["Name"]
a.head()
#type(a)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [24]:
nba[["Team","Name","Weight"]]
select=["Team","Name","Weight"]
nba[select]

               Team           Name  Weight
0    Boston Celtics  Avery Bradley   180.0
1    Boston Celtics    Jae Crowder   235.0
2    Boston Celtics   John Holland   205.0
3    Boston Celtics    R.J. Hunter   185.0
4    Boston Celtics  Jonas Jerebko   231.0
..              ...            ...     ...
453       Utah Jazz   Shelvin Mack   203.0
454       Utah Jazz      Raul Neto   179.0
455       Utah Jazz   Tibor Pleiss   256.0
456       Utah Jazz    Jeff Withey   231.0
457             NaN            NaN     NaN

[458 rows x 3 columns]